gbuzogany/nrf52840-mdk-usb-dongle/workspace/sleepy_publisher/main.c
    mode.mRxOnWhenIdle       = true;
    mode.mSecureDataRequests = true;

    error = otThreadSetLinkMode(thread_ot_instance_get(), mode);
    ASSERT(error == OT_ERROR_NONE);
}

static void set_radio_off(void) 
{
    otError error;
    otLinkModeConfig mode;
    memset(&mode, 0, sizeof(mode));

    mode.mRxOnWhenIdle       = false;
    mode.mSecureDataRequests = true;

    error = otThreadSetLinkMode(thread_ot_instance_get(), mode);
    ASSERT(error == OT_ERROR_NONE);
}

/***************************************************************************************************
 * @section buttons
 **************************************************************************************************/

// static void bsp_event_handler(bsp_event_t event)
// {
//     if (event == BSP_EVENT_KEY_0) 
//     {   
//             wake_up();

//             uint32_t err_code = mqttsn_client_search_gateway(&m_client, SEARCH_GATEWAY_TIMEOUT);
//             if (err_code != NRF_SUCCESS)
//             {
//                 NRF_LOG_ERROR("SEARCH GATEWAY message could not be sent. Error: 0x%x\r\n", err_code);
//                 otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "SEARCH GATEWAY message could not be sent. Error: 0x%x\r\n", err_code);
//             }
//     }
// }

/***************************************************************************************************
 * @section SAADC
 **************************************************************************************************/
void timer_handler(nrf_timer_event_t event_type, void * p_context)
{

    // if (state == 1 && counter < 20) {
    if (state == 1 && counter < 117) {
        counter++;
    }
    else if(state == 1) {
        counter = 0;
        state = 2;

        // power sensor
        nrf_gpio_pin_write(19, 0);

        otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "Sensor powered");
    }
    else if(state == 2) {
        // 500ms after, take measurement
        otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "Measurement taken");
        nrf_drv_saadc_sample();
        state = 3;
    }
    else if(state == 3) {
        // cut sensor power
        otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "Sensor cut");
        nrf_gpio_pin_write(19, 1);
        state = 1;
    }
}

// void saadc_sampling_event_init(void)
// {
//     ret_code_t err_code;

//     err_code = nrf_drv_ppi_init();
//     APP_ERROR_CHECK(err_code);

//     nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
//     timer_cfg.bit_width = NRF_TIMER_BIT_WIDTH_32;
//     err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, timer_handler);
//     APP_ERROR_CHECK(err_code);

//     /* setup m_timer for compare event every 400ms */
//     uint32_t ticks = nrf_drv_timer_ms_to_ticks(&m_timer, 2000);
//     nrf_drv_timer_extended_compare(&m_timer,
//                                    NRF_TIMER_CC_CHANNEL0,
//                                    ticks,
//                                    NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK,
//                                    false);
//     nrf_drv_timer_enable(&m_timer);
    
//     uint32_t timer_compare_event_addr = nrf_drv_timer_compare_event_address_get(&m_timer,
//                                                                                 NRF_TIMER_CC_CHANNEL0);
//     uint32_t saadc_sample_task_addr   = nrf_drv_saadc_sample_task_get();

//     /* setup ppi channel so that timer compare event is triggering sample task in SAADC */
//     err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
//     APP_ERROR_CHECK(err_code);

//     err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,
//                                           timer_compare_event_addr,
//                                           saadc_sample_task_addr);
//     APP_ERROR_CHECK(err_code);
// }


// void saadc_sampling_event_enable(void)
// {
//     ret_code_t err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
//     otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "saadc_sampling_event_enable");

//     APP_ERROR_CHECK(err_code);
// }


void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "saadc_callback: %d", p_event->type);

    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        ret_code_t err_code;

        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, SAMPLES_IN_BUFFER);
        APP_ERROR_CHECK(err_code);

        for (int i = 0; i < SAMPLES_IN_BUFFER; i++)
        {
            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "%d", p_event->data.done.p_buffer[i]);
        }

        if (mqttsn_client_state_get(&m_client) == MQTTSN_CLIENT_CONNECTED)
        {
            char buffer[100] = {};
            sprintf(buffer, "{ \"a0\" : %d, \"a1\" : %d, \"a2\" : %d, \"a3\" : %d }", 
                p_event->data.done.p_buffer[0],
                p_event->data.done.p_buffer[1],
                p_event->data.done.p_buffer[2],
                p_event->data.done.p_buffer[3]
            );

            otPlatLog(OT_LOG_LEVEL_DEBG, OT_LOG_REGION_UTIL, "Publishing ADC state %s", buffer);

            err_code = mqttsn_client_publish(&m_client, m_topic.topic_id, (uint8_t*)&buffer, 99, &m_msg_id);
            if (err_code != NRF_SUCCESS)
            {
                NRF_LOG_ERROR("PUBLISH message could not be sent. Error code: 0x%x\r\n", err_code);
            }
            LEDS_OFF(LEDS_MASK);
            sleep();
        }
        else if (has_valid_role())
        {
            find_gateway();
        }
    }
}


void saadc_init(void)
{
    ret_code_t err_code;
    uint32_t time_ms = 500;
    uint32_t time_ticks;
    
    err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);

    nrf_saadc_channel_config_t channel_config_a0 = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0);
    nrf_saadc_channel_config_t channel_config_a1 = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN1);
    nrf_saadc_channel_config_t channel_config_a2 = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);
    nrf_saadc_channel_config_t channel_config_a3 = NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);

    err_code = nrf_drv_saadc_channel_init(0, &channel_config_a0);
    APP_ERROR_CHECK(err_code);

