gbuzogany/nrf52840-mdk-usb-dongle/workspace/sleepy_publisher/main.c
    err_code = nrf_drv_saadc_channel_init(1, &channel_config_a1);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(2, &channel_config_a2);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_channel_init(3, &channel_config_a3);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(m_buffer, SAMPLES_IN_BUFFER);
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    err_code = nrf_drv_timer_init(&m_timer, &timer_cfg, timer_handler);
    APP_ERROR_CHECK(err_code);

    time_ticks = nrf_drv_timer_ms_to_ticks(&m_timer, time_ms);

    nrf_drv_timer_extended_compare(
        &m_timer, NRF_TIMER_CC_CHANNEL0, time_ticks, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

    nrf_drv_timer_enable(&m_timer);
}

void otPlatLog(otLogLevel aLogLevel, otLogRegion aLogRegion, const char *aFormat, ...)
{
    OT_UNUSED_VARIABLE(aLogLevel);
    OT_UNUSED_VARIABLE(aLogRegion);
    OT_UNUSED_VARIABLE(aFormat);

    // va_list ap;
    // va_start(ap, aFormat);
    // otCliPlatLogv(aLogLevel, aLogRegion, aFormat, ap);
    // va_end(ap);
}

void init_gpio() 
{
    nrf_gpio_cfg_output(19);
    nrf_gpio_pin_write(19, 1);
}

/***************************************************************************************************
 * @section Main
 **************************************************************************************************/

int main(int argc, char *argv[])
{
    log_init();
    // scheduler_init();
    // timer_init();
    leds_init();

    init_gpio();

    thread_instance_init();
    thread_bsp_init();

    saadc_init();
    // saadc_sampling_event_init();
    // saadc_sampling_event_enable();

    otInstance *instance = thread_ot_instance_get();

    setNetworkConfiguration(instance);

    /* Start the Thread network interface (CLI cmd > ifconfig up) */
    otIp6SetEnabled(instance, true);

    /* Start the Thread stack (CLI cmd > thread start) */
    otThreadSetEnabled(instance, true);

    mqttsn_init();

    while (true)
    {
        thread_process();
        // app_sched_execute();

        if (NRF_LOG_PROCESS() == false)
        {
            thread_sleep();
        }
    }
}

/**
 *@}
 **/

